/*
Baekjoon
<11866. 요세푸스 문제 0>

문제
요세푸스 문제는 다음과 같다.
1번부터 N번까지 N명의 사람이 원을 이루면서 앉아있고, 양의 정수 K(≤ N)가 주어진다.
이제 순서대로 K번째 사람을 제거한다. 한 사람이 제거되면 남은 사람들로 이루어진 원을 따라 이 과정을 계속해 나간다.
이 과정은 N명의 사람이 모두 제거될 때까지 계속된다. 원에서 사람들이 제거되는 순서를 (N, K)-요세푸스 순열이라고 한다.
예를 들어 (7, 3)-요세푸스 순열은 <3, 6, 2, 7, 5, 1, 4>이다.
N과 K가 주어지면 (N, K)-요세푸스 순열을 구하는 프로그램을 작성하시오.
==========================================================================================
입력
첫째 줄에 N과 K가 빈 칸을 사이에 두고 순서대로 주어진다. (1 ≤ K ≤ N ≤ 1,000)

출력
예제와 같이 요세푸스 순열을 출력한다.

=> 원형 큐인데 이거? 원형 큐로 풀어야하나보다....
==========================================================================================
*/

#include <iostream>
#include <queue>
using namespace std;

int main()
{
    int N, K; // 사람 수, 제거할 K번째 인간
    queue<int> q;
    cin >> N >> K;

    for(int i=1; i<=N; i++) q.push(i); // 사람 추가
    cout << "<";
    while(!q.empty()){
        for(int i=0; i<K-1; i++){ // K번째 사람 제거 : K번째 사람 빼고 (큐에 다시 넣고 빼기 => 원형)
            q.push(q.front());
            q.pop();
        }
        cout << q.front(); // 위의 작업으로 K번째 사람이 젤 앞에 있으므로 출력
        q.pop(); // 출력 후 제거
        if(!q.empty()) cout << ", ";
    }
    cout << ">";
    return 0;
}